
## Plan Result (prod)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpx-prod/providers/Microsoft.KeyVault/vaults/rpx-prod"
      + name                    = "appinsights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1372,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->